<?php
/**
 * 系统错误代码对照表
 *
 * @date: 2018/04/25
 */

namespace App;

class ErrorCode
{
    /**
     * 对照表
     *
     * @var array
     */
    protected static $dict = [
        //流程代码
        200 => "OK",
        403 => "没有访问权限",
        404 => "接口不存在",
        500 => "接口服务不可用",
        501 => "操作失败，请重试",

        //具体事务 1
        100000 => "未知错误",
        100001 => "token不存在或已过期，请重新登录", 
        100002 => "未同意注册协议",
        
        //用户管理 2
        200001 => "请输入正确的手机号码",
        200002 => "请输入正确的验证码",
        200003 => "请输入8-20位的密码",
        200004 => "Token已存在",
        200005 => "请输入8-20位的密码!",
        200006 => "注册失败，请重试!",
        200007 => "用户已注册",
        200009 => "用户未注册",
        200008 => "用户不存在或密码错误或登录权限被限制",
        200010 => "缺少用户id",
        200011 => "请填写审核不通过原因",
        200012 => "缺少必要参数",
        200013 => "用户不存在",
        200014 => "未登录",
        

        //后台服务 5
        500001 => "您没有权限",
    ];

    /**
     * 通过code获取错误信息
     *
     * return string 错误信息
     */
    public static function getMessage($code)
    {
        return isset(self::$dict[$code]) ? self::$dict[$code] : null;
    }

    /**
     * 获取错误对照表
     *
     * @return array
     */
    public function getDict()
    {
        return $this->dict;
    }
}
