<?php
/**
 * 消息模块（短信，微信，邮件）
 *
 * @date: 2018/05/04
 */

namespace App\Service\Utils;

class Message
{
    /**
     * 发送短信
     *
     * @param string $mobile 手机号
     * @param string $msg 短信内容
     * @param string $countryCode 国家代码
     * @param int $typeId 短信类型ID 2为验证码，默认为1
     */
    public static function sendSms($mobile, $msg, $countryCode="86", $typeId=1)
    {
        // 短信黑名单
        if (in_array($mobile, ['13660219719','13826477656','18826286681','15172188174','18620641297','15137885280','18318129296','13425255020','18814184215','18826238769','15692008226','13560186848','13660219719','13725240003','13544532495','13026118709','15277758962','13149904189','15807141544','18319100701','13580397300','15602284826','13570912669','18810347793','13611229261','13005335957','13580435807','18725893462','13527633879','18819423010','13580531432','13660852930','13502840061','18535174525','18911945594','18620256421','18435155394','13250286169','18826079446','13265965860','15602284910','15521221926','18600262875','15622728447','15800252083','13422108012','13694220833','15521072760','18604493831','15626060100','18707737679','15014296606','13450561547','13672429212','15602295095','15603011638','13250221594','18697982740','15566043770','13622226978','15566043513','15625132386','13680754684','15217616006','15622352420','13539631678','16620053970','15816487851','15800210008','18312414226','13104865258','18814122579','18211293599','13229452403','15626159970','15626176543','15626165434','13725122350','13929559798','15521051889','18620637554','15626184048','13536658537', '18613025831', '17665013691', '13751763853', // 内部人员
                               '17521284788', // 300080931
        ])) {
            return false;
        }
        
        if (\App\Helper\Helper::validMobile($mobile, $countryCode) !== true) return false;
        
        $client = new \GuzzleHttp\Client([
            'base_uri' => env("WEBSERVICE_URL"),
            'timeout'  => 10.0,
        ]);
        
        if ($countryCode == '86') {
            $response = $client->request('POST', "index/sendSMS", [
                'form_params' => [
                    'mobile' => $mobile,
                    'msg' => $msg,
                    'type_id' => $typeId,
                    'sign' => strtoupper(md5($mobile . date("YmdHi")))
                ]
            ]);
        } else {
            $response = $client->request('POST', "index/sendInterSMS", [
                'form_params' => [
                    'mobile' => $mobile,
                    'country_code' => "00" . $countryCode,
                    'msg' => $msg,
                    'type_id' => $typeId,
                    'sign' => strtoupper(md5($mobile . date("YmdHi")))
                ]
            ]);

            \Log::debug("send sms" . $response->getBody());
        }

        $result = json_decode($response->getBody(), true);

        if (empty($result)) return false;
        
        return $result["status"] == 1;
    }
}
